Finalize tutorial; Add reference for QueueserverAgent; Simplify pixi tasks and workflow
